art_share/app/controllers/artworks_controller.rb

    def index
        # user = User.find(params[:id])
        artworks = Artwork.all
---
SELECT "artworks".* FROM "artworks"

  def create
    artwork = Artwork.new(artwork_params)
    # debugger
    if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "julia's art"], ["image_url", "julia.com"], ["artist_id", 1], ["created_at", "2021-04-01 15:38:18.519219"], ["updated_at", "2021-04-01 15:38:18.519219"]]

  def update
    artwork = Artwork.find(params[:id])
        # debugger
     if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "updated_at" = $3 WHERE "artworks"."id" = $4  [["title", "Please Work!!!!!"], ["image_url", "Evan.com"], ["updated_at", "2021-04-01 16:46:01.898164"], ["id", 5]]