art_share/app/controllers/artwork_shares_controller.rb

SELECT "artwork_shares".* FROM "artwork_shares"
---
 def index
        artworkshares = ArtworkShare.all

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        artworkshare = ArtworkShare.find(params[:id])

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artwork_shares" SET "artwork_id" = $1, "updated_at" = $2 WHERE "artwork_shares"."id" = $3  [["artwork_id", 7], ["updated_at", "2021-04-01 18:06:23.802042"], ["id", 1]]
---
  def update
    artworkshare = ArtworkShare.find(params[:id])
        # debugger
     if artworkshare.update(artworkshare_params)

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 6]]
---
  def destroy
    artworkshare = ArtworkShare.find(params[:id])

    artworkshare.destroy