art_share/app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    debugger
    if user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "'Raz'"], ["created_at", "2021-04-01 14:51:21.092281"], ["updated_at", "2021-04-01 14:51:21.092281"]]